lib/tasks/setup.rake

INSERT INTO "abilities" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
INSERT INTO "poke_types" ("name", "double_damage_from", "double_damage_to", "half_damage_from", "half_damage_to", "no_damage_from", "no_damage_to", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
task set_data: :environment do
  poke_list = TaskHelpers.fetch_pokes
  abilities_list = TaskHelpers.fetch_abilities
  poke_types_list = TaskHelpers.fetch_types
  PokeDatum.create!(poke_list)
  PokeAbility.create!(abilities_list)
  PokeType.create!(poke_types_list)