app/views/shared/_pokemon_card.html.erb

      <div class="abilities-container">
        <% poke.abilities.each do |p_ability| %>
---
SELECT "abilities".* FROM "abilities" INNER JOIN "abilities_pokemons" ON "abilities"."id" = "abilities_pokemons"."ability_id" WHERE "abilities_pokemons"."pokemon_id" = $1  [["pokemon_id", 1]]