app/views/pokemons/show.html.erb

SELECT "abilities".* FROM "abilities"
---
        <%= form.label :ability %>
        <%= form.collection_select :name, PokeAbility.all, :name, :name, propmt: true %>

SELECT "poke_types".* FROM "poke_types"
---
        <%= form.label :poke_type %>
        <%= form.collection_select :name, PokeType.all, :name, :name, propmt: true %>