app/controllers/pokemons_controller.rb

SELECT "pokemons".* FROM "pokemons"
---
  def index
    @pokemons = Pokemon.all

INSERT INTO "pokemons" ("name", "trainer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "butterfree"], ["trainer_id", 1], ["created_at", "2022-01-13 11:56:59.390307"], ["updated_at", "2022-01-13 11:56:59.390307"]]
---
  def create
    @pokemon = Pokemon.new(pokemon_params)
    @pokemon.sprites = PokeDatum.find_by(name: pokemon_params['name']).sprites

    respond_to do |format|
      if @pokemon.save

UPDATE "pokemons" SET "name" = $1, "updated_at" = $2 WHERE "pokemons"."id" = $3  [["name", "stench"], ["updated_at", "2022-01-13 15:14:47.361798"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @pokemon.update(pokemon_params)

DELETE FROM "pokemons" WHERE "pokemons"."id" = $1  [["id", 1]]
---
  def destroy
    @pokemon.destroy

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_pokemon
    @pokemon = Pokemon.find(params[:id])