app/controllers/poke_types_controller.rb

  def add_poke_type
    pokemon = Pokemon.find_by(id: params[:poke_id])
    poke_type = PokeType.find_by(name: params[:name])
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "poke_types".* FROM "poke_types" WHERE "poke_types"."name" = $1 LIMIT $2  [["name", "normal"], ["LIMIT", 1]]