app/views/trainers/show.html.erb

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."trainer_id" = $1  [["trainer_id", 1]]
---
  <div class='list'>
    <% @trainer.pokemons.each do |poke| %>